'use strict';

const mockData = [
  {
    "id": `9DBYPA`,
    "category": [
      `Разное`
    ],
    "description": `Даю недельную гарантию. Пользовались бережно и только по большим праздникам. Товар в отличном состоянии. Бонусом отдам все аксессуары.`,
    "picture": `item04.jpg`,
    "title": `Продам новую приставку Sony Playstation 5`,
    "type": `offer`,
    "sum": 70127,
    "comments": [
      {
        "id": `RwAm8W`,
        "text": `Продаю в связи с переездом. Отрываю от сердца. Оплата наличными или перевод на карту?`
      },
      {
        "id": `HfHuFB`,
        "text": `Оплата наличными или перевод на карту? А где блок питания?`
      }
    ]
  },
  {
    "id": `j_erQp`,
    "category": [
      `Разное`
    ],
    "description": `Бонусом отдам все аксессуары. Если найдёте дешевле — сброшу цену. Если товар не понравится — верну всё до последней копейки. При покупке с меня бесплатная доставка в черте города.`,
    "picture": `item09.jpg`,
    "title": `Куплю пазлы с рисунком кота`,
    "type": `sale`,
    "sum": 96234,
    "comments": [
      {
        "id": `rSWZzr`,
        "text": `Продаю в связи с переездом. Отрываю от сердца. А сколько игр в комплекте?`
      },
      {
        "id": `SP-2s_`,
        "text": `Вы что?! В магазине дешевле. Совсем немного...`
      },
      {
        "id": `Nf-aRS`,
        "text": `Продаю в связи с переездом. Отрываю от сердца. С чем связана продажа? Почему так дешёво?`
      },
      {
        "id": `VYmnI5`,
        "text": `Неплохо, но дорого.`
      }
    ]
  },
  {
    "id": `AwWNXK`,
    "category": [
      `Животные`
    ],
    "description": `Пользовались бережно и только по большим праздникам. Даю недельную гарантию. Если найдёте дешевле — сброшу цену. Три по цене двух только до конца дня.`,
    "picture": `item08.jpg`,
    "title": `Куплю породистого кота`,
    "type": `offer`,
    "sum": 41814,
    "comments": [
      {
        "id": `m67daM`,
        "text": `А сколько игр в комплекте? Вы что?! В магазине дешевле. Продаю в связи с переездом. Отрываю от сердца.`
      },
      {
        "id": `mczI-7`,
        "text": `Неплохо, но дорого. А сколько игр в комплекте?`
      }
    ]
  },
  {
    "id": `M3HI0J`,
    "category": [
      `Мебель`
    ],
    "description": `Бонусом отдам все аксессуары. Товар в отличном состоянии. Если товар не понравится — верну всё до последней копейки. При покупке с меня бесплатная доставка в черте города.`,
    "picture": `item12.jpg`,
    "title": `Продам шкаф для одежды`,
    "type": `sale`,
    "sum": 35797,
    "comments": [
      {
        "id": `Uku3sJ`,
        "text": `Вы что?! В магазине дешевле.`
      },
      {
        "id": `rQPc4F`,
        "text": `Почему в таком ужасном состоянии? А где блок питания? Оплата наличными или перевод на карту?`
      }
    ]
  },
  {
    "id": `NOdhjw`,
    "category": [
      `Посуда`
    ],
    "description": `Если найдёте дешевле — сброшу цену. При покупке с меня бесплатная доставка в черте города. Бонусом отдам все аксессуары. Если товар не понравится — верну всё до последней копейки.`,
    "picture": `item08.jpg`,
    "title": `Продам шкаф для одежды`,
    "type": `offer`,
    "sum": 10435,
    "comments": [
      {
        "id": `hbitvV`,
        "text": `Совсем немного... Оплата наличными или перевод на карту? А сколько игр в комплекте?`
      },
      {
        "id": `Q1Mz3z`,
        "text": `А сколько игр в комплекте? Совсем немного...`
      },
      {
        "id": `qaeq6z`,
        "text": `Совсем немного...`
      }
    ]
  }
];

module.exports = {
  mockData
};
